aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
// Following commands are SD Card Specific commands.
// SDMMC_APP_CMD should be sent before sending these commands.
#define SD_CMD_APP_SD_SET_BUSWIDTH      ((uint8_t)6)   // (ACMD6) Defines the data bus width to be used for data transfer. The allowed data bus
                                                       // widths are given in SCR register.
#define SD_CMD_SD_APP_STATUS            ((uint8_t)13)  // (ACMD13) Sends the SD status.
#define SD_CMD_SD_APP_OP_COND           ((uint8_t)41)  // (ACMD41) Sends host capacity support information (HCS) and asks the accessed card to
                                                       // send its operating condition register (OCR) content in the response on the CMD line.
#define SD_CMD_SD_APP_SEND_SCR          ((uint8_t)51)  // Reads the SD Configuration Register (SCR).



/* Typedef(s) -------------------------------------------------------------------------------------------------------*/

typedef enum
{
    HAL_OK       = 0x00,
    HAL_ERROR    = 0x01,
    HAL_BUSY     = 0x02,
    HAL_TIMEOUT  = 0x03
} StatusTypeDef;


typedef enum
{
    SD_SINGLE_BLOCK    = 0,       // Single block operation
    SD_MULTIPLE_BLOCK  = 1,       // Multiple blocks operation
} SD_Operation_t;

typedef struct
{
  volatile SD_CSDTypedef    SD_csd;         // SD card specific data register
  volatile SD_CIDTypedef    SD_cid;         // SD card identification number register
  uint64_t                  CardCapacity;   // Card capacity
  uint32_t                  CardBlockSize;  // Card block size
  uint16_t                  RCA;            // SD relative card address
  uint8_t                   CardType;       // SD card type

} SD_CardInfo_t;


/* Variable(s) ------------------------------------------------------------------------------------------------------*/

static SD_HandleTypeDef uSdHandle;
static SD_CardInfo_t    SD_CardInfo;
static DSTATUS          Stat;

/* Private function(s) ----------------------------------------------------------------------------------------------*/

static bool 	        SD_IsDetected           (void);
static void             SD_GetResponse          (uint32_t* pResponse);
static void             SD_DMA_RxCplt           (void);
static void             SD_DMA_TxCplt           (void);
static StatusTypeDef    SD_DMA_Abort            (DMA_Stream_TypeDef* pDMA_Stream);
static SD_Error_t  HAL_SD_Init             (void);
static SD_Error_t  SD_InitializeCard       (void);
static uint8_t 	        SD_ReadBlocks_DMA       (uint32_t *pData, uint64_t ReadAddr, uint32_t BlockSize, uint32_t NumOfBlocks);
static uint8_t 	        SD_WriteBlocks_DMA      (uint32_t *pData, uint64_t WriteAddr, uint32_t BlockSize, uint32_t NumOfBlocks);
static SD_Error_t  SD_CheckWriteOperation  (uint32_t Timeout);
static SD_Error_t  SD_CheckReadOperation   (uint32_t Timeout);


static SD_Error_t  SD_Select_Deselect      (uint64_t addr);
static SD_Error_t  SD_PowerON              (void);
static void             SD_PowerOFF             (void);
static SD_Error_t  SD_SendStatus           (uint32_t *pCardStatus);
static SD_Error_t  SD_IsCardProgramming    (uint8_t *pStatus);
static SD_Error_t  SD_CmdError             (void);
static SD_Error_t  SD_CmdResp1Error        (uint8_t SD_CMD);
static SD_Error_t  SD_CmdResp7Error        (void);
static SD_Error_t  SD_CmdResp3Error        (void);
static SD_Error_t  SD_CmdResp2Error        (void);
static SD_Error_t  SD_CmdResp6Error        (uint8_t SD_CMD, uint16_t *pRCA);
static SD_Error_t  SD_WideBusEnable        (void);
static SD_Error_t  SD_WideBusDisable       (void);
static SD_Error_t  SD_FindSCR              (uint32_t *pSCR);



/** -----------------------------------------------------------------------------------------------------------------*/
/**		SD_IsDetected
  *
  * @brief  Test if card is present
  * @param  uint8_t       true or false
  */
static bool SD_IsDetected(void)
{
    return (IO_GetInputPinValue(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) == 0);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		GetResponse
  *
  * @brief  Get response from SD device
  * @param  uint32_t*       pResponse
  */
static void SD_GetResponse(uint32_t* pResponse)
{
    if(pResponse != NULL)
    {
        pResponse[0] = SDMMC1->RESP1;
        pResponse[1] = SDMMC1->RESP2;
        pResponse[2] = SDMMC1->RESP3;
        pResponse[3] = SDMMC1->RESP4;
    }
}


/** -----------------------------------------------------------------------------------------------------------------*/
static StatusTypeDef SD_DMA_Abort(DMA_Stream_TypeDef* pDMA_Stream)
{
    uint32_t tickstart;

    // Disable the stream
    pDMA_Stream->CR &= ~DMA_SxCR_EN;

    // Get tick
    tickstart = Tick;

    // Check if the DMA Stream is effectively disabled
    tickstart = 0;
    while((pDMA_Stream->CR & DMA_SxCR_EN) != 0)
    {
        if((Tick - tickstart ) > 1000)      // Check for the Timeout
        {
            return HAL_TIMEOUT;
        }
    }

    return HAL_OK;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  SD DMA transfer complete Rx callback.
  */
static void SD_DMA_RxCplt(void)
{
    uSdHandle.DmaTransferCplt = 1;          // DMA transfer is complete
    while(uSdHandle.SdTransferCplt == 0){}; // Wait until SD transfer is complete
    SD_DMA_Abort(DMA2_Stream3);             // Disable the DMA channel
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  SD DMA transfer complete Tx callback.
  */
static void SD_DMA_TxCplt(void)
{
    uSdHandle.DmaTransferCplt = 1;          // DMA transfer is complete
    while(uSdHandle.SdTransferCplt == 0){}; // Wait until SD transfer is complete
    SD_DMA_Abort(DMA2_Stream6);             // Disable the DMA channel
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initializes the SD card.
  * @retval HAL SD error state
  */
SD_Error_t HAL_SD_Init(void)
{
    SD_Error_t errorstate = SD_OK;

    // Initialize SDMMC peripheral interface with default configuration for SD card initialization
    SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
    SDMMC1->CLKCR |=  (uint32_t)SDMMC_INIT_CLK_DIV;

