aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Identify card operating voltage
    errorstate = SD_PowerON();

    if(errorstate != SD_OK)
    {
        return errorstate;
    }

    // Initialize the present card and put them in idle state
    errorstate = SD_InitializeCard();

    if(errorstate != SD_OK)
    {
        return errorstate;
    }

    // Read CSD/CID MSD registers
    errorstate = SD_GetCardInfo();

    if(errorstate == SD_OK)
    {
        // Select the Card
        errorstate = SD_Select_Deselect((uint32_t)(((uint32_t)SD_CardInfo.RCA) << 16));
    }

    // Configure SDMMC peripheral interface
    SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;

    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initializes all cards or single card as the case may be Card(s) come
  *         into standby state.
  * @retval SD Card error state
  */
static SD_Error_t SD_InitializeCard(void)
{
    SD_Error_t errorstate = SD_OK;
    uint16_t sd_rca = 1;

    if((SDMMC1->POWER & SDMMC_POWER_PWRCTRL) == 0) // Power off
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }

    if(uSdHandle.CardType != SECURE_DIGITAL_IO_CARD)
    {
        // Send CMD2 ALL_SEND_CID
        SDMMC1->ARG  =  (uint32_t)0;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_ALL_SEND_CID | SDMMC_CMD_RESPONSE_LONG | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp2Error()) != SD_OK)
        {
            return errorstate;
        }

        // Get Card identification number data
        SD_GetResponse(uSdHandle.CID);
    }

    if((uSdHandle.CardType == STD_CAPACITY_SD_CARD_V1_1)    || (uSdHandle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||
       (uSdHandle.CardType == SECURE_DIGITAL_IO_COMBO_CARD) || (uSdHandle.CardType == HIGH_CAPACITY_SD_CARD))
    {
        // Send CMD3 SET_REL_ADDR with argument 0
        // SD Card publishes its RCA.
        SDMMC1->ARG  =  (uint32_t)0;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_REL_ADDR | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp6Error( SD_CMD_SET_REL_ADDR, &sd_rca)) != SD_OK)
        {
            return errorstate;
        }
    }

    if(uSdHandle.CardType != SECURE_DIGITAL_IO_CARD)
    {
        // Get the SD card RCA
        uSdHandle.RCA = sd_rca;

        // Send CMD9 SEND_CSD with argument as card's RCA
        SDMMC1->ARG  =  (uint32_t)(uint32_t)(uSdHandle.RCA << 16);
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SEND_CSD | SDMMC_CMD_RESPONSE_LONG | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp2Error()) == SD_OK)
        {
            // Get Card Specific Data
            SD_GetResponse(uSdHandle.CSD);
        }
    }

    // Card are initialized
    return errorstate;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Reads block(s) from a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by the function SD_CheckReadOperation()
  *         to check the completion of the read process
  * @param  pReadBuffer: Pointer to the buffer that will contain the received data
  * @param  ReadAddr: Address from where data is to be read
  * @param  BlockSize: SD card Data block size
  * @note   BlockSize must be 512 bytes.
  * @param  NumberOfBlocks: Number of blocks to read.
  * @retval SD Card error state
  */
SD_Error_t SD_ReadBlocks_DMA(uint32_t *pReadBuffer, uint64_t ReadAddr, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t CmdIndex;

    SDMMC1->DCTRL = 0;                  // Initialize data control register
    uSdHandle.SdTransferCplt  = 0;      // Initialize handle flags
    uSdHandle.DmaTransferCplt = 0;
    uSdHandle.SdTransferErr   = SD_OK;

    // Initialize SD Read operation
    uSdHandle.SdOperation = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;

    // Enable transfer interrupts
    SDMMC1->MASK |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE | SDMMC_MASK_DATAENDIE | SDMMC_MASK_RXOVERRIE);

    // Enable the DMA Channel
    SDMMC1->DCTRL |= SDMMC_DCTRL_DMAEN;                                                     // Enable SDMMC DMA transfer
    DMA2_Stream3->CR  &= ~DMA_SxCR_EN;                                                      // Disable the Peripheral
    DMA2_Stream3->NDTR = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                        // Configure DMA Stream data length
    DMA2_Stream3->M0AR = (uint32_t)pReadBuffer;                                             // Configure DMA Stream destination address
    DMA2_Stream3->CR  |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;    // Enable all interrupts
    DMA2_Stream3->FCR |= DMA_SxFCR_FEIE;
    DMA2_Stream3->CR  |= DMA_SxCR_EN;                                                       // Enable the Peripheral

    if(uSdHandle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        BlockSize = 512;
        ReadAddr /= 512;
    }

    // Set Block Size for Card
    SDMMC1->ARG  =  (uint32_t)BlockSize;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp1Error(SD_CMD_SET_BLOCKLEN)) != SD_OK)
    {
        return errorstate;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SDMMC1->DTIMER = SD_DATATIMEOUT;
    SDMMC1->DLEN   = BlockSize * NumberOfBlocks;
    SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_512B | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN);

    // Send CMD18 READ_MULT_BLOCK with argument data address
    // or send CMD17 READ_SINGLE_BLOCK depending on number of block
    CmdIndex = (NumberOfBlocks > 1) ?SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK;

    SDMMC1->ARG  =  (uint32_t)ReadAddr;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(CmdIndex | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    errorstate = SD_CmdResp1Error((NumberOfBlocks > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK);

    // Update the SD transfer error in SD handle
    uSdHandle.SdTransferErr = errorstate;

    return errorstate;
}


