aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Writes block(s) to a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by the function HAL_SD_CheckWriteOperation()
  *         to check the completion of the write process (by SD current status polling).
  * @param  pWriteBuffer: pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be read
  * @param  BlockSize: the SD card Data block size
  * @note   BlockSize must be 512 bytes.
  * @param  NumberOfBlocks: Number of blocks to write
  * @retval SD Card error state
  */
SD_Error_t SD_WriteBlocks_DMA(uint32_t *pWriteBuffer, uint64_t WriteAddr, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t        CmdIndex;

    SDMMC1->DCTRL = 0;              // Initialize data control register
    uSdHandle.SdTransferCplt  = 0;  // Initialize handle flags
    uSdHandle.DmaTransferCplt = 0;
    uSdHandle.SdTransferErr   = SD_OK;

    // Initialize SD Write operation
    uSdHandle.SdOperation = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;

    // Enable transfer interrupts
    SDMMC1->MASK |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE | SDMMC_MASK_DATAENDIE | SDMMC_MASK_TXUNDERRIE);

    // Enable the DMA Channel
    SDMMC1->DCTRL |= SDMMC_DCTRL_DMAEN;                                                     // Enable SDMMC DMA transfer
    DMA2_Stream6->CR  &= ~DMA_SxCR_EN;                                                      // Disable the Peripheral
    DMA2_Stream6->NDTR = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                        // Configure DMA Stream data length
    DMA2_Stream6->M0AR = (uint32_t)pWriteBuffer;                                            // Configure DMA Stream destination address
    DMA2_Stream6->CR  |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;    // Enable all interrupts
    DMA2_Stream6->FCR |= DMA_SxFCR_FEIE;
    DMA2_Stream6->CR  |= DMA_SxCR_EN;                                                       // Enable the Peripheral

    // Enable SDMMC DMA transfer
    SDMMC1->DCTRL |= SDMMC_DCTRL_DMAEN;

    if(uSdHandle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        BlockSize  = 512;
        WriteAddr /= 512;
    }

    // Set Block Size for Card
    SDMMC1->ARG  =  (uint32_t)BlockSize;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
    {
        return errorstate;
    }

    // Check number of blocks command
    // Send CMD24 WRITE_SINGLE_BLOCK
    // Send CMD25 WRITE_MULT_BLOCK with argument data address
    CmdIndex = (NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK;

    // Set Block Size for Card
    SDMMC1->ARG  =  (uint32_t)WriteAddr;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(CmdIndex | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((SD_CmdResp1Error((NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK)) != SD_OK)
    {
        return errorstate;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SDMMC1->DTIMER = SD_DATATIMEOUT;
    SDMMC1->DLEN   = (uint32_t)(BlockSize * NumberOfBlocks);
    SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_512B | SDMMC_DCTRL_DTEN);

    uSdHandle.SdTransferErr = errorstate;

    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function waits until the SD DMA data read transfer is finished.
  *         This API should be called after SD_ReadBlocks_DMA() function
  *         to insure that all data sent by the card is already transferred by the
  *         DMA controller.
  * @param  Timeout: Timeout duration
  * @retval SD Card error state
  */
SD_Error_t SD_CheckReadOperation(uint32_t Timeout)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t timeout = Timeout;
    uint32_t tmp1, tmp2;
    SD_Error_t tmp3;

    // Wait for DMA/SD transfer end or SD error variables to be in SD handle
    tmp1 = uSdHandle.DmaTransferCplt;
    tmp2 = uSdHandle.SdTransferCplt;
    tmp3 = (SD_Error_t)uSdHandle.SdTransferErr;

    while(((tmp1 & tmp2) == 0) && (tmp3 == SD_OK) && (timeout > 0))
    {
        tmp1 = uSdHandle.DmaTransferCplt;
        tmp2 = uSdHandle.SdTransferCplt;
        tmp3 = (SD_Error_t)uSdHandle.SdTransferErr;
        timeout--;
    }

    timeout = Timeout;

    // Wait until the Rx transfer is no longer active
    while(((SDMMC1->STA & SDMMC_STA_RXACT) != 0) && (timeout > 0))
    {
        timeout--;
    }

    // Send stop command in multi block read
    if(uSdHandle.SdOperation == SD_MULTIPLE_BLOCK)
    {
        errorstate = SD_StopTransfer();
    }

    if((timeout == 0) && (errorstate == SD_OK))
    {
        errorstate = SD_DATA_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // Return error state
    if(uSdHandle.SdTransferErr != SD_OK)
    {
        return (SD_Error_t)(uSdHandle.SdTransferErr);
    }

    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function waits until the SD DMA data write transfer is finished.
  *         This API should be called after SD_WriteBlocks_DMA() function
  *         to insure that all data sent by the card is already transferred by the
  *         DMA controller.
  * @param  Timeout: Timeout duration
  * @retval SD Card error state
  */
SD_Error_t SD_CheckWriteOperation(uint32_t Timeout)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t timeout = Timeout;
    uint32_t tmp1, tmp2;
    SD_Error_t tmp3;

    // Wait for DMA/SD transfer end or SD error variables to be in SD handle
    tmp1 = uSdHandle.DmaTransferCplt;
    tmp2 = uSdHandle.SdTransferCplt;
    tmp3 = (SD_Error_t)uSdHandle.SdTransferErr;

    while(((tmp1 & tmp2) == 0) && (tmp3 == SD_OK) && (timeout > 0))
    {
        tmp1 = uSdHandle.DmaTransferCplt;
        tmp2 = uSdHandle.SdTransferCplt;
        tmp3 = (SD_Error_t)uSdHandle.SdTransferErr;
        timeout--;
    }

    timeout = Timeout;

    // Wait until the Tx transfer is no longer active
    while(((SDMMC1->STA & SDMMC_STA_TXACT) != 0) && (timeout > 0))
    {
        timeout--;
    }

    // Send stop command in multiblock write
    if(uSdHandle.SdOperation == SD_MULTIPLE_BLOCK)
    {
        errorstate = SD_StopTransfer();
    }

    if((timeout == 0) && (errorstate == SD_OK))
    {
        errorstate = SD_DATA_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

