aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Return error state
    if(uSdHandle.SdTransferErr != SD_OK)
    {
        return (SD_Error_t)(uSdHandle.SdTransferErr);
    }

    // Wait until write is complete
    while(SD_GetStatus() != SD_TRANSFER_OK){};

    return errorstate;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Erases the specified memory area of the given SD card.
  * @param  startaddr: Start byte address
  * @param  endaddr: End byte address
  * @retval SD Card error state
  */
SD_Error_t SD_Erase(uint64_t startaddr, uint64_t endaddr)
{
    SD_Error_t errorstate = SD_OK;

    uint32_t delay         = 0;
    __IO uint32_t maxdelay = 0;
    uint8_t cardstate      = 0;

    // Check if the card command class supports erase command
    if(((uSdHandle.CSD[1] >> 20) & SD_CCCC_ERASE) == 0)
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }

    // Get max delay value
    maxdelay = 120000 / (((SDMMC1->CLKCR) & 0xFF) + 2);

    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Get start and end block for high capacity cards
    if(uSdHandle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        startaddr /= 512;
        endaddr   /= 512;
    }

    // According to sd-card spec 1.0 ERASE_GROUP_START (CMD32) and erase_group_end(CMD33)
    if ((uSdHandle.CardType == STD_CAPACITY_SD_CARD_V1_1) || (uSdHandle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||
        (uSdHandle.CardType == HIGH_CAPACITY_SD_CARD))
    {
        // Send CMD32 SD_ERASE_GRP_START with argument as addr
        SDMMC1->ARG  =  (uint32_t)startaddr;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_ERASE_GRP_START | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp1Error( SD_CMD_SD_ERASE_GRP_START)) != SD_OK)
        {
            return errorstate;
        }

        // Send CMD33 SD_ERASE_GRP_END with argument as addr
        SDMMC1->ARG  =  (uint32_t)endaddr;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_ERASE_GRP_END | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp1Error( SD_CMD_SD_ERASE_GRP_END)) != SD_OK)
        {
            return errorstate;
        }
    }

    // Send CMD38 ERASE
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_ERASE  | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp1Error( SD_CMD_ERASE)) != SD_OK)
    {
        return errorstate;
    }

    for(; delay < maxdelay; delay++);

    // Wait until the card is in programming state
    errorstate = SD_IsCardProgramming( &cardstate);

    delay = SD_DATATIMEOUT;

    while((delay > 0) && (errorstate == SD_OK) && ((cardstate == SD_CARD_PROGRAMMING) || (cardstate == SD_CARD_RECEIVING)))
    {
        errorstate = SD_IsCardProgramming( &cardstate);
        delay--;
    }

    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns information about specific card.
  *         contains all SD cardinformation
  * @retval SD Card error state
  */
SD_Error_t SD_GetCardInfo(void)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t tmp = 0;

    SD_CardInfo.CardType = (uint8_t)(uSdHandle.CardType);
    SD_CardInfo.RCA      = (uint16_t)(uSdHandle.RCA);

    // Byte 0
    tmp = (uSdHandle.CSD[0] & 0xFF000000) >> 24;
    SD_CardInfo.SD_csd.CSDStruct      = (uint8_t)((tmp & 0xC0) >> 6);
    SD_CardInfo.SD_csd.SysSpecVersion = (uint8_t)((tmp & 0x3C) >> 2);
    SD_CardInfo.SD_csd.Reserved1      = tmp & 0x03;

    // Byte 1
    tmp = (uSdHandle.CSD[0] & 0x00FF0000) >> 16;
    SD_CardInfo.SD_csd.TAAC = (uint8_t)tmp;

    // Byte 2
    tmp = (uSdHandle.CSD[0] & 0x0000FF00) >> 8;
    SD_CardInfo.SD_csd.NSAC = (uint8_t)tmp;

    // Byte 3
    tmp = uSdHandle.CSD[0] & 0x000000FF;
    SD_CardInfo.SD_csd.MaxBusClkFrec = (uint8_t)tmp;

    // Byte 4
    tmp = (uSdHandle.CSD[1] & 0xFF000000) >> 24;
    SD_CardInfo.SD_csd.CardComdClasses = (uint16_t)(tmp << 4);

    // Byte 5
    tmp = (uSdHandle.CSD[1] & 0x00FF0000) >> 16;
    SD_CardInfo.SD_csd.CardComdClasses |= (uint16_t)((tmp & 0xF0) >> 4);
    SD_CardInfo.SD_csd.RdBlockLen       = (uint8_t)(tmp & 0x0F);

    // Byte 6
    tmp = (uSdHandle.CSD[1] & 0x0000FF00) >> 8;
    SD_CardInfo.SD_csd.PartBlockRead   = (uint8_t)((tmp & 0x80) >> 7);
    SD_CardInfo.SD_csd.WrBlockMisalign = (uint8_t)((tmp & 0x40) >> 6);
    SD_CardInfo.SD_csd.RdBlockMisalign = (uint8_t)((tmp & 0x20) >> 5);
    SD_CardInfo.SD_csd.DSRImpl         = (uint8_t)((tmp & 0x10) >> 4);
    SD_CardInfo.SD_csd.Reserved2       = 0; /*!< Reserved */

    if((uSdHandle.CardType == STD_CAPACITY_SD_CARD_V1_1) || (uSdHandle.CardType == STD_CAPACITY_SD_CARD_V2_0))
    {
        SD_CardInfo.SD_csd.DeviceSize = (tmp & 0x03) << 10;

        // Byte 7
        tmp = (uint8_t)(uSdHandle.CSD[1] & 0x000000FF);
        SD_CardInfo.SD_csd.DeviceSize |= (tmp) << 2;

        // Byte 8
        tmp = (uint8_t)((uSdHandle.CSD[2] & 0xFF000000) >> 24);
        SD_CardInfo.SD_csd.DeviceSize |= (tmp & 0xC0) >> 6;

        SD_CardInfo.SD_csd.MaxRdCurrentVDDMin = (tmp & 0x38) >> 3;
        SD_CardInfo.SD_csd.MaxRdCurrentVDDMax = (tmp & 0x07);

        // Byte 9
        tmp = (uint8_t)((uSdHandle.CSD[2] & 0x00FF0000) >> 16);
        SD_CardInfo.SD_csd.MaxWrCurrentVDDMin = (tmp & 0xE0) >> 5;
        SD_CardInfo.SD_csd.MaxWrCurrentVDDMax = (tmp & 0x1C) >> 2;
        SD_CardInfo.SD_csd.DeviceSizeMul      = (tmp & 0x03) << 1;

        // Byte 10
        tmp = (uint8_t)((uSdHandle.CSD[2] & 0x0000FF00) >> 8);
        SD_CardInfo.SD_csd.DeviceSizeMul |= (tmp & 0x80) >> 7;

        SD_CardInfo.CardCapacity  = (SD_CardInfo.SD_csd.DeviceSize + 1) ;
        SD_CardInfo.CardCapacity *= (1 << (SD_CardInfo.SD_csd.DeviceSizeMul + 2));
        SD_CardInfo.CardBlockSize = 1 << (SD_CardInfo.SD_csd.RdBlockLen);
        SD_CardInfo.CardCapacity *= SD_CardInfo.CardBlockSize;
    }
    else if(uSdHandle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        // Byte 7
        tmp = (uint8_t)(uSdHandle.CSD[1] & 0x000000FF);
        SD_CardInfo.SD_csd.DeviceSize = (tmp & 0x3F) << 16;

        // Byte 8
        tmp = (uint8_t)((uSdHandle.CSD[2] & 0xFF000000) >> 24);

        SD_CardInfo.SD_csd.DeviceSize |= (tmp << 8);

        // Byte 9
        tmp = (uint8_t)((uSdHandle.CSD[2] & 0x00FF0000) >> 16);

        SD_CardInfo.SD_csd.DeviceSize |= (tmp);

        // Byte 10
        tmp = (uint8_t)((uSdHandle.CSD[2] & 0x0000FF00) >> 8);

        SD_CardInfo.CardCapacity  = ((SD_CardInfo.SD_csd.DeviceSize + 1)) * 512 * 1024;
        SD_CardInfo.CardBlockSize = 512;
    }
    else
    {
        // Not supported card type
        errorstate = SD_ERROR;
    }

    SD_CardInfo.SD_csd.EraseGrSize = (tmp & 0x40) >> 6;
    SD_CardInfo.SD_csd.EraseGrMul  = (tmp & 0x3F) << 1;

