aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Byte 11
    tmp = (uint8_t)(uSdHandle.CSD[2] & 0x000000FF);
    SD_CardInfo.SD_csd.EraseGrMul     |= (tmp & 0x80) >> 7;
    SD_CardInfo.SD_csd.WrProtectGrSize = (tmp & 0x7F);

    // Byte 12
    tmp = (uint8_t)((uSdHandle.CSD[3] & 0xFF000000) >> 24);
    SD_CardInfo.SD_csd.WrProtectGrEnable = (tmp & 0x80) >> 7;
    SD_CardInfo.SD_csd.ManDeflECC        = (tmp & 0x60) >> 5;
    SD_CardInfo.SD_csd.WrSpeedFact       = (tmp & 0x1C) >> 2;
    SD_CardInfo.SD_csd.MaxWrBlockLen     = (tmp & 0x03) << 2;

    // Byte 13
    tmp = (uint8_t)((uSdHandle.CSD[3] & 0x00FF0000) >> 16);
    SD_CardInfo.SD_csd.MaxWrBlockLen      |= (tmp & 0xC0) >> 6;
    SD_CardInfo.SD_csd.WriteBlockPaPartial = (tmp & 0x20) >> 5;
    SD_CardInfo.SD_csd.Reserved3           = 0;
    SD_CardInfo.SD_csd.ContentProtectAppli = (tmp & 0x01);

    // Byte 14
    tmp = (uint8_t)((uSdHandle.CSD[3] & 0x0000FF00) >> 8);
    SD_CardInfo.SD_csd.FileFormatGrouop = (tmp & 0x80) >> 7;
    SD_CardInfo.SD_csd.CopyFlag         = (tmp & 0x40) >> 6;
    SD_CardInfo.SD_csd.PermWrProtect    = (tmp & 0x20) >> 5;
    SD_CardInfo.SD_csd.TempWrProtect    = (tmp & 0x10) >> 4;
    SD_CardInfo.SD_csd.FileFormat       = (tmp & 0x0C) >> 2;
    SD_CardInfo.SD_csd.ECC              = (tmp & 0x03);

    // Byte 15
    tmp = (uint8_t)(uSdHandle.CSD[3] & 0x000000FF);
    SD_CardInfo.SD_csd.CSD_CRC   = (tmp & 0xFE) >> 1;
    SD_CardInfo.SD_csd.Reserved4 = 1;

    // Byte 0
    tmp = (uint8_t)((uSdHandle.CID[0] & 0xFF000000) >> 24);
    SD_CardInfo.SD_cid.ManufacturerID = tmp;

    // Byte 1
    tmp = (uint8_t)((uSdHandle.CID[0] & 0x00FF0000) >> 16);
    SD_CardInfo.SD_cid.OEM_AppliID = tmp << 8;

    // Byte 2
    tmp = (uint8_t)((uSdHandle.CID[0] & 0x000000FF00) >> 8);
    SD_CardInfo.SD_cid.OEM_AppliID |= tmp;

    // Byte 3
    tmp = (uint8_t)(uSdHandle.CID[0] & 0x000000FF);
    SD_CardInfo.SD_cid.ProdName1 = tmp << 24;

    // Byte 4
    tmp = (uint8_t)((uSdHandle.CID[1] & 0xFF000000) >> 24);
    SD_CardInfo.SD_cid.ProdName1 |= tmp << 16;

    // Byte 5
    tmp = (uint8_t)((uSdHandle.CID[1] & 0x00FF0000) >> 16);
    SD_CardInfo.SD_cid.ProdName1 |= tmp << 8;

    // Byte 6
    tmp = (uint8_t)((uSdHandle.CID[1] & 0x0000FF00) >> 8);
    SD_CardInfo.SD_cid.ProdName1 |= tmp;

    // Byte 7
    tmp = (uint8_t)(uSdHandle.CID[1] & 0x000000FF);
    SD_CardInfo.SD_cid.ProdName2 = tmp;

    // Byte 8
    tmp = (uint8_t)((uSdHandle.CID[2] & 0xFF000000) >> 24);
    SD_CardInfo.SD_cid.ProdRev = tmp;

    // Byte 9
    tmp = (uint8_t)((uSdHandle.CID[2] & 0x00FF0000) >> 16);
    SD_CardInfo.SD_cid.ProdSN = tmp << 24;

    // Byte 10
    tmp = (uint8_t)((uSdHandle.CID[2] & 0x0000FF00) >> 8);
    SD_CardInfo.SD_cid.ProdSN |= tmp << 16;

    // Byte 11
    tmp = (uint8_t)(uSdHandle.CID[2] & 0x000000FF);
    SD_CardInfo.SD_cid.ProdSN |= tmp << 8;

    // Byte 12
    tmp = (uint8_t)((uSdHandle.CID[3] & 0xFF000000) >> 24);
    SD_CardInfo.SD_cid.ProdSN |= tmp;

    // Byte 13
    tmp = (uint8_t)((uSdHandle.CID[3] & 0x00FF0000) >> 16);
    SD_CardInfo.SD_cid.Reserved1   |= (tmp & 0xF0) >> 4;
    SD_CardInfo.SD_cid.ManufactDate = (tmp & 0x0F) << 8;

    // Byte 14
    tmp = (uint8_t)((uSdHandle.CID[3] & 0x0000FF00) >> 8);
    SD_CardInfo.SD_cid.ManufactDate |= tmp;

    // Byte 15
    tmp = (uint8_t)(uSdHandle.CID[3] & 0x000000FF);
    SD_CardInfo.SD_cid.CID_CRC   = (tmp & 0xFE) >> 1;
    SD_CardInfo.SD_cid.Reserved2 = 1;

    return errorstate;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enables wide bus operation for the requested card if supported by
  *         card.
  * @param  WideMode: Specifies the SD card wide bus mode
  *          This parameter can be one of the following values:
  *            @arg SDMMC_BUS_WIDE_8B: 8-bit data transfer (Only for MMC)
  *            @arg SDMMC_BUS_WIDE_4B: 4-bit data transfer
  *            @arg SDMMC_BUS_WIDE_1B: 1-bit data transfer
  * @retval SD Card error state
  */
SD_Error_t SD_WideBusOperationConfig(uint32_t WideMode)
{
    SD_Error_t errorstate;

    // MMC Card does not support this feature
    if(uSdHandle.CardType == MULTIMEDIA_CARD)
    {
        errorstate = SD_UNSUPPORTED_FEATURE;
    }
    else if((uSdHandle.CardType == STD_CAPACITY_SD_CARD_V1_1) || (uSdHandle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||\
            (uSdHandle.CardType == HIGH_CAPACITY_SD_CARD))
    {
             if(WideMode == SDMMC_BUS_WIDE_8B)  errorstate = SD_UNSUPPORTED_FEATURE;
        else if(WideMode == SDMMC_BUS_WIDE_4B)  errorstate = SD_WideBusEnable();
        else if(WideMode == SDMMC_BUS_WIDE_1B)  errorstate = SD_WideBusDisable();
        else                                    errorstate = SD_INVALID_PARAMETER;  // WideMode is not a valid argument

        if(errorstate == SD_OK)
        {
            // Configure the SDMMC peripheral
            SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
            SDMMC1->CLKCR |=  (uint32_t)WideMode;
        }
    }

    return errorstate;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Aborts an ongoing data transfer.
  * @retval SD Card error state
  */
SD_Error_t SD_StopTransfer(void)
{
    // Send CMD12 STOP_TRANSMISSION
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_STOP_TRANSMISSION | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    return SD_CmdResp1Error(SD_CMD_STOP_TRANSMISSION);;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Switches the SD card to High Speed mode.
  *         This API must be used after "Transfer State"
  * @retval SD Card error state
  */
SD_Error_t HAL_SD_HighSpeed(void)
{
    SD_Error_t errorstate = SD_OK;

    uint8_t SD_hs[64]  = {0};
    uint32_t SD_scr[2] = {0, 0};
    uint32_t SD_SPEC   = 0;
    uint32_t count = 0, *tempbuff = (uint32_t *)SD_hs;

