aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Initialize the Data control register
    SDMMC1->DCTRL = 0;

    // Get SCR Register
    if((errorstate = SD_FindSCR( SD_scr)) != SD_OK)
    {
        return errorstate;
    }

    // Test the Version supported by the card
    SD_SPEC = (SD_scr[1]  & 0x01000000) | (SD_scr[1]  & 0x02000000);

    if(SD_SPEC != SD_ALLZERO)
    {
        // Set Block Size for Card
        SDMMC1->ARG  =  (uint32_t)64;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
        {
            return errorstate;
        }

        // Configure the SD DPSM (Data Path State Machine)
        SDMMC1->DTIMER = SD_DATATIMEOUT;
        SDMMC1->DLEN   = 64;
        SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
        SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_64B | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN);

        // Send CMD6 switch mode
        SDMMC1->ARG  =  (uint32_t)0x80FFFF01;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_HS_SWITCH | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp1Error( SD_CMD_HS_SWITCH)) != SD_OK)
        {
            return errorstate;
        }

        while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
        {
            if((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0)
            {
                for (count = 0; count < 8; count++)
                {
                    *(tempbuff + count) = SDMMC1->FIFO;
                }

                tempbuff += 8;
            }
        }

        if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
            return SD_DATA_TIMEOUT;
        }
        else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
            return SD_DATA_CRC_FAIL;
        }
        else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
            return SD_RX_OVERRUN;
        }

        count = SD_DATATIMEOUT;

        while(((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0) && (count > 0))
        {
            *tempbuff = SDMMC1->FIFO;
            tempbuff++;
            count--;
        }

        // Clear all the static flags
        SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

        // Test if the switch mode HS is ok
        if((SD_hs[13]& 2) != 2)
        {
            errorstate = SD_UNSUPPORTED_FEATURE;
        }
    }

    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns the current SD card's status.
  * @param  pSDstatus: Pointer to the buffer that will contain the SD card status
  * @retval SD Card error state
  */
SD_Error_t HAL_SD_SendSDStatus(uint32_t *pSDstatus)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t count = 0;

    // Check SD response
    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Set block size for card if it is not equal to current block size for card
    SDMMC1->ARG  =  (uint32_t)64;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
    {
        return errorstate;
    }

    // Send CMD55
    SDMMC1->ARG  =  (uint32_t)(uSdHandle.RCA << 16);
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
    {
        return errorstate;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SDMMC1->DTIMER = SD_DATATIMEOUT;
    SDMMC1->DLEN   = 64;
    SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(SDMMC_DATABLOCK_SIZE_64B | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN);

    // Send ACMD13 (SD_APP_STAUS)  with argument as card's RCA */
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_APP_STATUS | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp1Error( SD_CMD_SD_APP_STATUS)) != SD_OK)
    {
        return errorstate;
    }

    // Get status data
    while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
    {
        if((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0)
        {
            for(count = 0; count < 8; count++)
            {
                *(pSDstatus + count) = SDMMC1->FIFO;
            }

            pSDstatus += 8;
        }
    }

    if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
        return SD_DATA_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
        return SD_DATA_CRC_FAIL;
    }
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
        return SD_RX_OVERRUN;
    }

    count = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0) && (count > 0))
    {
        *pSDstatus = SDMMC1->FIFO;
        pSDstatus++;
        count--;
    }

    // Clear all the static status flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Gets the current sd card data status.
  * @retval Data Transfer state
  */
SD_TransferStateTypedef SD_GetStatus(void)
{
    uint32_t            resp1 = 0;
    SD_CardStateTypedef CardState = SD_CARD_TRANSFER;

