aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
  // Get SD card state
    if(SD_SendStatus(&resp1) != SD_OK) CardState =  SD_CARD_ERROR;
    else                               CardState = (SD_CardStateTypedef)((resp1 >> 9) & 0x0F);

    // Find SD status according to card state
    if     (CardState == SD_CARD_TRANSFER)  return SD_TRANSFER_OK;
    else if(CardState == SD_CARD_ERROR)     return SD_TRANSFER_ERROR;
    else                                    return SD_TRANSFER_BUSY;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Gets the SD card status.
  * @retval SD Card error state
  */
SD_Error_t SD_GetCardStatus(SD_CardStatusTypedef* pCardStatus)
{
    SD_Error_t errorstate;
    uint32_t tmp = 0;
    uint32_t sd_status[16];

    if((errorstate = SD_SendSDStatus( sd_status)) != SD_OK)
    {
        return errorstate;
    }

    // Byte 0
    tmp = (sd_status[0] & 0xC0) >> 6;
    pCardStatus->DAT_BUS_WIDTH = (uint8_t)tmp;

    // Byte 0
    tmp = (sd_status[0] & 0x20) >> 5;
    pCardStatus->SECURED_MODE = (uint8_t)tmp;

    // Byte 2
    tmp = (sd_status[2] & 0xFF);
    pCardStatus->SD_CARD_TYPE = (uint8_t)(tmp << 8);

    // Byte 3
    tmp = (sd_status[3] & 0xFF);
    pCardStatus->SD_CARD_TYPE |= (uint8_t)tmp;

    // Byte 4
    tmp = (sd_status[4] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA = (uint8_t)(tmp << 24);

    // Byte 5
    tmp = (sd_status[5] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)(tmp << 16);

    // Byte 6
    tmp = (sd_status[6] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)(tmp << 8);

    // Byte 7
    tmp = (sd_status[7] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)tmp;

    // Byte 8
    tmp = (sd_status[8] & 0xFF);
    pCardStatus->SPEED_CLASS = (uint8_t)tmp;

    // Byte 9
    tmp = (sd_status[9] & 0xFF);
    pCardStatus->PERFORMANCE_MOVE = (uint8_t)tmp;

    // Byte 10
    tmp = (sd_status[10] & 0xF0) >> 4;
    pCardStatus->AU_SIZE = (uint8_t)tmp;

    // Byte 11
    tmp = (sd_status[11] & 0xFF);
    pCardStatus->ERASE_SIZE = (uint8_t)(tmp << 8);

    // Byte 12
    tmp = (sd_status[12] & 0xFF);
    pCardStatus->ERASE_SIZE |= (uint8_t)tmp;

    // Byte 13
    tmp = (sd_status[13] & 0xFC) >> 2;
    pCardStatus->ERASE_TIMEOUT = (uint8_t)tmp;

    // Byte 13
    tmp = (sd_status[13] & 0x3);
    pCardStatus->ERASE_OFFSET = (uint8_t)tmp;

    return SD_OK;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Selects od Deselects the corresponding card.
  * @param  addr: Address of the card to be selected
  * @retval SD Card error state
  */
static SD_Error_t SD_Select_Deselect(uint64_t addr)
{
    // Send CMD7 SDMMC_SEL_DESEL_CARD
    SDMMC1->ARG  =  (uint32_t)addr;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_SEL_DESEL_CARD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // check for error conditions
    return SD_CmdResp1Error( SD_CMD_SEL_DESEL_CARD);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enquires cards about their operating voltage and configures clock
  *         controls and stores SD information that will be needed in future
  *         in the SD handle.
  * @retval SD Card error state
  */
static SD_Error_t SD_PowerON(void)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t response = 0, count = 0, validvoltage = 0;
    uint32_t sdtype = SD_STD_CAPACITY;

    // Power ON Sequence -------------------------------------------------------
    SDMMC1->CLKCR &= ~SDMMC_CLKCR_CLKEN;        // Disable SDMMC Clock
    SDMMC1->POWER = SDMMC_POWER_PWRCTRL;        // Set Power State to ON

    // 1ms: required power up waiting time before starting the SD initialization sequence
    uint32_t tickstart = 0;
    tickstart = Tick;
    while((Tick - tickstart) < 1) {};

    SDMMC1->CLKCR |= SDMMC_CLKCR_CLKEN;           // Enable SDMMC Clock

    // CMD0: GO_IDLE_STATE -----------------------------------------------------
    // No CMD response required
    SDMMC1->ARG  =  0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_GO_IDLE_STATE | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdError()) != SD_OK)
    {
        // CMD Response Timeout (wait for CMDSENT flag)
        return errorstate;
    }

    // CMD8: SEND_IF_COND ------------------------------------------------------
    // Send CMD8 to verify SD card interface operating condition
    // Argument: - [31:12]: Reserved (shall be set to '0')
    //- [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
    //- [7:0]: Check Pattern (recommended 0xAA)
    // CMD Response: R7 */
    SDMMC1->ARG  =  SD_CHECK_PATTERN;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_SDMMC_SEND_IF_COND | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    if((errorstate = SD_CmdResp7Error()) == SD_OK)
    {
        // SD Card 2.0
        uSdHandle.CardType = STD_CAPACITY_SD_CARD_V2_0;
        sdtype        = SD_HIGH_CAPACITY;
    }

    // Send CMD55
    SDMMC1->ARG  =  (uint32_t)0;
    SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
    SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

    // Check for error conditions
    // If errorstate is Command Timeout, it is a MMC card
    // If errorstate is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch) or SD card 1.x
    if((errorstate = SD_CmdResp1Error(SD_CMD_APP_CMD)) == SD_OK)
    {
        // SD CARD
        // Send ACMD41 SD_APP_OP_COND with Argument 0x80100000
        while((!validvoltage) && (count < SD_MAX_VOLT_TRIAL))
        {

            // SEND CMD55 APP_CMD with RCA as 0
            SDMMC1->ARG  =  (uint32_t)0;
            SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
            SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

            // Check for error conditions
            if((errorstate = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
            {
                return errorstate;
            }

            // Send CMD41
            SDMMC1->ARG  =  SD_VOLTAGE_WINDOW_SD | sdtype;
            SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
            SDMMC1->CMD |=  (uint32_t)(SD_CMD_SD_APP_OP_COND | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

            // Check for error conditions
            if((errorstate = SD_CmdResp3Error()) != SD_OK)
            {
                return errorstate;
            }

            response = SDMMC1->RESP1;                               // Get command response
            validvoltage = (((response >> 31) == 1) ? 1 : 0);       // Get operating voltage
            count++;
        }

