aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R3 (OCR) response.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp3Error(void)
{
    SD_Error_t errorstate = SD_OK;

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R2 (CID or CSD) response.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp2Error(void)
{
    SD_Error_t errorstate = SD_OK;

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CCRCFAILC;
        return SD_CMD_CRC_FAIL;
    }
    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R6 (RCA) response.
  * @param  SD_CMD: The sent command index
  * @param  pRCA: Pointer to the variable that will contain the SD card relative
  *         address RCA
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp6Error(uint8_t SD_CMD, uint16_t *pRCA)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t response_r1;

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CCRCFAILC;
        return SD_CMD_CRC_FAIL;
    }

    // Check response received is of desired command
    if((uint8_t)SDMMC1->RESPCMD != SD_CMD)
    {
        return SD_ILLEGAL_CMD;
    }

    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;       // Clear all the static flags
    response_r1 = SDMMC1->RESP1;                // We have received response, retrieve it.
    if((response_r1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO)
    {
        *pRCA = (uint16_t) (response_r1 >> 16);
        return errorstate;
    }

    if((response_r1 & SD_R6_GENERAL_UNKNOWN_ERROR) == SD_R6_GENERAL_UNKNOWN_ERROR)  return SD_GENERAL_UNKNOWN_ERROR;
    if((response_r1 & SD_R6_ILLEGAL_CMD) == SD_R6_ILLEGAL_CMD)                      return SD_ILLEGAL_CMD;
    if((response_r1 & SD_R6_COM_CRC_FAILED) == SD_R6_COM_CRC_FAILED)                return SD_COM_CRC_FAILED;
    return errorstate;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enables the SDMMC wide bus mode.
  * @retval SD Card error state
  */
static SD_Error_t SD_WideBusEnable(void)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t scr[2] = {0, 0};

    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Get SCR Register
    if((errorstate = SD_FindSCR(scr)) != SD_OK)
    {
        return errorstate;
    }

    // If requested card supports wide bus operation
    if((scr[1] & SD_WIDE_BUS_SUPPORT) != SD_ALLZERO)
    {
        // Send CMD55 APP_CMD with argument as card's RCA.
        SDMMC1->ARG = (uint32_t)(uSdHandle.RCA << 16);
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp1Error(SD_CMD_APP_CMD)) != SD_OK)
        {
            return errorstate;
        }

        // Send ACMD6 APP_CMD with argument as 2 for wide bus mode
        SDMMC1->ARG  =  (uint32_t)2;
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_SD_SET_BUSWIDTH | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        errorstate = SD_CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);
        return errorstate;
    }
    else
    {
        errorstate = SD_REQUEST_NOT_APPLICABLE;
        return errorstate;
    }
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Disables the SDMMC wide bus mode.
  * @retval SD Card error state
  */
static SD_Error_t SD_WideBusDisable(void)
{
    SD_Error_t errorstate = SD_OK;
    uint32_t scr[2] = {0, 0};

    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Get SCR Register
    if((errorstate = SD_FindSCR(scr)) != SD_OK)
    {
        return errorstate;
    }

    // If requested card supports 1 bit mode operation
    if((scr[1] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO)
    {
        // Send CMD55 APP_CMD with argument as card's RCA
        SDMMC1->ARG = (uint32_t)(uSdHandle.RCA << 16);
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        if((errorstate = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
        {
            return errorstate;
        }

        // Send ACMD6 APP_CMD with argument as 0 for single bus mode
        SDMMC1->ARG  =  (uint32_t)0;                // Set the SDMMC Argument value
        SDMMC1->CMD &= ~(uint32_t)CMD_CLEAR_MASK;   // Set SDMMC command parameters
        SDMMC1->CMD |=  (uint32_t)(SD_CMD_APP_SD_SET_BUSWIDTH | SDMMC_CMD_RESPONSE_SHORT | SDMMC_CMD_CPSMEN);

        // Check for error conditions
        return SD_CmdResp1Error( SD_CMD_APP_SD_SET_BUSWIDTH);;
    }
    else
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }
}


