aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initialize the SDMMC1 module, DMA, and IO
  */
void SD_Initialize(void)
{
    uint32_t prioritygroup;

     // Reset SDIO Module
    RCC->APB2RSTR |=  RCC_APB2RSTR_SDMMC1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_SDMMC1RST;

    // Enable SDIO clock
    RCC->APB2ENR |= RCC_APB2ENR_SDMMC1EN;

    // Enable DMA2 clocks
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;

	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_8,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_9,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_10,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_11,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOC,               RCC_AHB1ENR_GPIOCEN, GPIO_PIN_12,   GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(GPIOD,               RCC_AHB1ENR_GPIODEN, GPIO_PIN_2,    GPIO_MODER_ALTERNATE, GPIO_TYPE_PIN_PP,      GPIO_OSPEEDR_VERY_HIGH, 12);
	IO_PinInit(SD_DETECT_GPIO_PORT, RCC_AHB1ENR_GPIOCEN, SD_DETECT_PIN, GPIO_MODER_INPUT,     GPIO_TYPE_PIN_PULL_UP, GPIO_OSPEEDR_LOW,       0);

    prioritygroup = NVIC_GetPriorityGrouping();

    // NVIC configuration for SDIO interrupts
    NVIC_SetPriority(SDMMC1_IRQn, NVIC_EncodePriority(prioritygroup, 5, 0));
    NVIC_EnableIRQ(SDMMC1_IRQn);

    // Initialize DMA2 channel 3 for RX from SD CARD
    DMA2_Stream3->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream3->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->LIFCR        = IFCR_CLEAR_MASK_STREAM3;                           // Clear all interrupt flags
    DMA2_Stream3->CR   = (DMA_CHANNEL_4        | DMA_SxCR_PFCTRL        |   // Prepare the DMA Stream configuration
                          DMA_MINC_ENABLE      | DMA_PDATAALIGN_WORD    |   // And write to DMA Stream CR register
                          DMA_MDATAALIGN_WORD  | DMA_PRIORITY_VERY_HIGH |
                          DMA_MBURST_INC4      | DMA_PBURST_INC4);

    DMA2_Stream3->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // Initialize DMA2 channel 6 for TX to SD CARD
    DMA2_Stream6->CR   = 0;                                                 // Reset DMA Stream control register
    DMA2_Stream6->PAR  = (uint32_t)&SDMMC1->FIFO;
    DMA2->HIFCR        = IFCR_CLEAR_MASK_STREAM6;                           // Clear all interrupt flags
    DMA2_Stream6->CR   = (DMA_CHANNEL_4        | DMA_SxCR_PFCTRL        |   // Prepare the DMA Stream configuration
                          DMA_MINC_ENABLE      | DMA_PDATAALIGN_WORD    |   // And write to DMA Stream CR register
                          DMA_MDATAALIGN_WORD  | DMA_PRIORITY_VERY_HIGH |
                          DMA_MBURST_INC4      | DMA_PBURST_INC4        |
                          DMA_MEMORY_TO_PERIPH);
    DMA2_Stream6->FCR  = (DMA_SxFCR_DMDIS | DMA_SxFCR_FTH);                 // Configuration FIFO control register

    // NVIC configuration for DMA transfer complete interrupt
    NVIC_SetPriority(DMA2_Stream3_IRQn, NVIC_EncodePriority(prioritygroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream3_IRQn);
    NVIC_SetPriority(DMA2_Stream6_IRQn, NVIC_EncodePriority(prioritygroup, 6, 0));
    NVIC_EnableIRQ(DMA2_Stream6_IRQn);
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_initialize(void)
{
	uint8_t SD_state = MSD_OK;

	// Check if SD card is present
	if(SD_IsDetected() != SD_PRESENT)   return MSD_ERROR_SD_NOT_PRESENT;
	// HAL SD initialization
    if(HAL_SD_Init() != SD_OK)          SD_state = MSD_ERROR;

	// Configure SD Bus width
	if(SD_state == MSD_OK)
	{
		// Enable wide operation
		if(SD_WideBusOperationConfig(SDMMC_BUS_WIDE_4B) != SD_OK) SD_state = MSD_ERROR;
		else SD_state = MSD_OK;
	}

	// Configure the SDCARD device
	Stat = STA_NOINIT;
	if (SD_state == MSD_OK) Stat &= ~STA_NOINIT;

	return Stat;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_status(void)
{
	Stat = STA_NOINIT;

	// Check SDCARD status
	if (SD_GetStatus() == MSD_OK) Stat &= ~STA_NOINIT;
	else Stat |= STA_NOINIT;

	return Stat;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_ioctl(BYTE cmd, void *buff)
{
	DRESULT res = RES_ERROR;

	// Check if init OK
	if(Stat & STA_NOINIT) return RES_NOTRDY;

	switch(cmd)
	{
		// Make sure that no pending write process
		case CTRL_SYNC:
        {
			res = RES_OK;
			break;
        }

		// Get number of sectors on the disk (DWORD)
		case GET_SECTOR_COUNT:
        {
			SD_GetCardInfo();
			*(DWORD *)buff = SD_CardInfo.CardCapacity / BLOCK_SIZE;
			res = RES_OK;
			break;
        }

		// Get R/W sector size (WORD)
		case GET_SECTOR_SIZE:
        {
			*(WORD *)buff = BLOCK_SIZE;
			res = RES_OK;
			break;
        }

		// Get erase block size in unit of sector (DWORD)
		case GET_BLOCK_SIZE:
        {
			*(DWORD*)buff = BLOCK_SIZE;
			break;
        }

		default:
        {
			res = RES_PARERR;
        }
	}

	return res;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_read(BYTE *buff, DWORD sector, UINT count)
{
	uint8_t SD_state = MSD_OK;

	// Read block(s) in DMA transfer mode
	if(SD_ReadBlocks_DMA((uint32_t *)buff, (uint64_t) (sector * BLOCK_SIZE), BLOCK_SIZE, count) != SD_OK)
    {
        SD_state = MSD_ERROR;
    }

	// Wait until transfer is complete
	if(SD_state == MSD_OK)
	{
		if(SD_CheckReadOperation((uint32_t)SD_DATATIMEOUT) != SD_OK) SD_state = MSD_ERROR;
		else SD_state = MSD_OK;
	}

