aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
	if(SD_state == MSD_OK)
    {
        return RES_OK;
    }

	return RES_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_write(const BYTE *buff, DWORD sector, UINT count)
{
	uint8_t SD_state = MSD_OK;

	// Write block(s) in DMA transfer mode
	if(SD_WriteBlocks_DMA((uint32_t *)buff, (sector * BLOCK_SIZE), BLOCK_SIZE, count) != SD_OK)
    {
        SD_state = MSD_ERROR;
    }

	// Wait until transfer is complete
	if(SD_state == MSD_OK)
	{
		if(SD_CheckWriteOperation((uint32_t)SD_DATATIMEOUT) != SD_OK) SD_state = MSD_ERROR;
		else SD_state = MSD_OK;
	}

	if(SD_state == MSD_OK)
    {
        return RES_OK;
    }

	return RES_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
FRESULT FATFS_GetDriveSize(char* pStr, FATFS_Size_t* SizeStruct)
{
	FATFS*  pFS;
    DWORD   FreeCluster;
	FRESULT Result;

    // Get volume information and free clusters of drive
    if((Result = f_getfree(pStr, &FreeCluster, &pFS)) == FR_OK)
    {
        // Get total sectors and free sectors
        SizeStruct->Total = (pFS->n_fatent - 2) * pFS->csize * 0.5;
        SizeStruct->Free = FreeCluster * pFS->csize * 0.5;
    }

    return Result;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function handles SD card interrupt request.
  */
void SDMMC1_IRQHandler(void)
{
    // Check for SDMMC interrupt flags
    if((SDMMC1->STA & SDMMC_STA_DATAEND) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DATAENDC;
        uSdHandle.SdTransferCplt = 1;           // SD transfer is complete
        uSdHandle.SdTransferErr  = SD_OK;       // No transfer error
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
        uSdHandle.SdTransferErr = SD_DATA_CRC_FAIL;
    }
    else if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
        uSdHandle.SdTransferErr = SD_DATA_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
        uSdHandle.SdTransferErr = SD_RX_OVERRUN;
    }
    else if((SDMMC1->STA & SDMMC_STA_TXUNDERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_TXUNDERRC;
        uSdHandle.SdTransferErr = SD_TX_UNDERRUN;
    }

    // Disable all SDMMC peripheral interrupt sources
    SDMMC1->MASK &= ~(SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE | SDMMC_MASK_DATAENDIE  |
                      SDMMC_MASK_TXFIFOHEIE | SDMMC_MASK_RXFIFOHFIE | SDMMC_MASK_TXUNDERRIE |
                      SDMMC_MASK_RXOVERRIE);
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function handles DMA2 Stream 3 interrupt request.
  */
void DMA2_Stream3_IRQHandler(void)
{
    // Transfer Error Interrupt management
    if((DMA2->LISR & DMA_LISR_TEIF3) != 0)
    {
        if((DMA2_Stream3->CR & DMA_SxCR_TEIE) != 0)
        {
            DMA2_Stream3->CR   &= ~DMA_SxCR_TEIE;       // Disable the transfer error interrupt
            DMA2->LIFCR = DMA_LIFCR_CTEIF3;             // Clear the transfer error flag
        }
    }

    // FIFO Error Interrupt management
    if((DMA2->LISR & DMA_LISR_FEIF3) != 0)
    {
        if((DMA2_Stream3->FCR & DMA_SxFCR_FEIE) != 0)
        {
            DMA2_Stream3->FCR   &= ~DMA_SxFCR_FEIE;     // Disable the FIFO Error interrupt
            DMA2->LIFCR = DMA_LIFCR_CFEIF3;             // Clear the FIFO error flag
        }
    }

    // Direct Mode Error Interrupt management
    if((DMA2->LISR & DMA_LISR_DMEIF3) != 0)
    {
        if((DMA2_Stream3->CR & DMA_SxCR_DMEIE) != 0)
        {
            DMA2_Stream3->CR   &= ~DMA_SxCR_DMEIE;       // Disable the direct mode Error interrupt
            DMA2->LIFCR = DMA_LIFCR_CDMEIF3;             // Clear the FIFO error flag
        }
    }

    // Half Transfer Complete Interrupt management
    if((DMA2->LISR & DMA_LISR_HTIF3) != 0)
    {
        if((DMA2_Stream3->CR & DMA_SxCR_HTIE) != 0)
        {
            if(((DMA2_Stream3->CR) & (uint32_t)(DMA_SxCR_DBM)) != 0)    // Multi_Buffering mode enabled
            {
                DMA2->LIFCR = DMA_LIFCR_CHTIF3;                         // Clear the half transfer complete flag
            }
            else
            {
                if((DMA2_Stream3->CR & DMA_SxCR_CIRC) == 0)             // Disable the half transfer interrupt if the DMA mode is not CIRCULAR
                {
                    DMA2_Stream3->CR   &= ~DMA_SxCR_HTIE;               // Disable the half transfer interrupt
                }

                DMA2->LIFCR = DMA_LIFCR_CHTIF3;                         // Clear the half transfer complete flag
            }
        }
    }

    // Transfer Complete Interrupt management
    if((DMA2->LISR & DMA_LISR_TCIF3) != 0)
    {
        if((DMA2_Stream3->CR & DMA_SxCR_TCIE) != 0)
        {
            if((DMA2_Stream3->CR & (uint32_t)(DMA_SxCR_DBM)) != 0)
            {
                DMA2->LIFCR = DMA_LIFCR_CTCIF3;                         // Clear the transfer complete flag
            }
            else //Disable the transfer complete interrupt if the DMA mode is not CIRCULAR
            {
                if((DMA2_Stream3->CR & DMA_SxCR_CIRC) == 0)
                {
                    DMA2_Stream3->CR &= ~DMA_SxCR_TCIE;                 // Disable the transfer complete interrupt
                }

                DMA2->LIFCR = DMA_LIFCR_CTCIF3;                         // Clear the transfer complete flag
                SD_DMA_RxCplt();
            }
        }
    }
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function handles DMA2 Stream 6 interrupt request.
  */
void DMA2_Stream6_IRQHandler(void)
{
    // Transfer Error Interrupt management
    if((DMA2->HISR & DMA_HISR_TEIF6) != 0)
    {
        if((DMA2_Stream6->CR & DMA_SxCR_TEIE) != 0)
        {
            DMA2_Stream6->CR   &= ~DMA_SxCR_TEIE;       // Disable the transfer error interrupt
            DMA2->HIFCR = DMA_HIFCR_CTEIF6;             // Clear the transfer error flag
        }
    }

    // FIFO Error Interrupt management
    if((DMA2->HISR & DMA_HISR_FEIF6) != 0)
    {
        if((DMA2_Stream6->FCR & DMA_SxFCR_FEIE) != 0)
        {
            DMA2_Stream6->FCR   &= ~DMA_SxFCR_FEIE;     // Disable the FIFO Error interrupt
            DMA2->HIFCR = DMA_HIFCR_CFEIF6;             // Clear the FIFO error flag
        }
    }

